tutorials/multiphase/interFoam/RAS/DTCHullMoving/0/omega.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    bottom
    {
        type            symmetryPlane;
    }
    side
    {
        type            symmetryPlane;
    }
    midPlane
    {
        type            symmetryPlane;
    }
    hull
    {
        type            omegaWallFunction;
        value           uniform 2;
    }
}


// ************************************************************************* //
